tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"

#ensure brew is up to date
brew update
brew upgrade


# Modern replacement for 'ls'
brew "exa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Distributed revision control system
brew "git"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Terminal multiplexer
brew "tmux"
# Enable Windows-like alt-tab
cask "alt-tab"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack"
cask "font-hack-nerd-font"
cask "git-credential-manager-core"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Minimal installer for conda
cask "miniconda"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
